{
    "title": "Welcome to CodeAlong.IO!",
    "author": "Kendra",
    "posting_date": "date",
    "blog_post": ["Welcome to CodeAlong.io! My intent with this blog is to share my journey as I get familiar with Flutter and learn how to use it in a real-life, production level app. While I have some software background I haven't coded an application from start to finish, and I/'m usually on the backend when I am. So, this is my attempt to expand my knowledge and share my learnings with you as I go. In the past I've found that I learn best when watching and coding alongside someone else. I'm looking to replicate that for you in this blog. There are a number of great tutorial blogs out there and as you will see, I will lean on a number of them. Where I think they fall a bit short however, is they are entirely in execution mode, rather than teaching you how I go about going from start to finish, how to fix errors, understand taking the documentation implementations and turning them into real, complete code.",
                  "In the past I've found that I learn best when watching and coding alongside someone else. I'm looking to replicate that for you in this blog. There are a number of great tutorial blogs out there and as you will see, I will lean on a number of them. Where I think they fall a bit short however, is they are entirely in execution mode, rather than teaching you how I go about going from start to finish, how to fix errors, understand taking the documentation implementations and turning them into real, complete code.",
                  "I've only been working with Flutter for a short time however, I think it's a great gateway for getting started in software development and if i can help break down some of the barriers for others I'll count it a win.",
                  "I will share a pretty high level of detail of how I am coding specific aspects and if you already have it nailed, please feel free to skip along to the pertinent parts. It's not intended to be a pure tutorial but rather focused on the how. Each section will specify the commit's the last body of work are linked to so you can follow along directly in the code yourself.",
                  "Eventually I would love for this to grow into a wider community where we can all discuss and learn together but to start I'll focus on building out a very basic blog in an incremental manner. I will focus on building out the full end to end solution that will be very basic to start. I don't actually think a blog is the best application to build as there are already so many easy frameworks out there but for me, I wanted to write about this process and I needed a blog do to so and well, I'm not very creative so a blog we shall build.",
                  "I hope you find this entertaining and informational and that it inspires you to build what excites you. I can't wait to see what this community will create!"
                ]
}